// alert("Здравствуйте, перед проверкой задания, пожалуйста, обратите внимание на сообщение в консоли :)");

console.warn(`Спасибо, что обратили внимание на это сообщение.

  Инструкция по функционалу:
  - При нажатии правой кнопкой мыши по textarea, всплывают стрелки, с помощью которых можно переходить по строкам. При повторном нажатии правой кнопкой мыши, кнопки исчезают.
  - Кнопка shift объединена с кнопкой caps, т.е. при нажатии на caps работает capslock, при нажатии на физической клавиатуре shift, на виртуальной клавиатуре будет работать shift.
  - При включенном shift и caps выводятся дополнительные символы, а буквы переходят в строчный режим.
  - При нажатии правой кнопкой мыши по capslock (виртуальная клавиатура) включается/выключается shift.
  - При нажатии левой кнопкой мыши по capslock (виртуальная клавиатура) включается/выключается capslock.

  На данный момент я переделываю функционал данной задачи, т.к. при проверке выявили некоторые недочёты.
  Прошу при выставлении оценки оставить свои контакты по которым с вами можно связаться для перепроверки.
  Спасибо :) `);
